# Pandas

This is a python library used to analyze data. 

In Pandas,one dimensional arrays are known as series objects and multidimensional arrays are known as Data frames

### Series Objects

In [1]:
import pandas as pd

In [2]:
n1 = pd.Series([1,2,3,4,5])     #it gives us a lableled 1D array
n1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
n1 = pd.Series([1,2,3,4], index = ['a','b','c','d'])   #we can also change the indices of the array
n1

a    1
b    2
c    3
d    4
dtype: int64

>Creating Series object from a dictionary

In [4]:
d1 = {'a':10,'b':20,'c':40}
n2 = pd.Series(d1)
n2

a    10
b    20
c    40
dtype: int64

>We can also change the order of indexing

In [5]:
pd.Series(d1,index=['b','c','a','d'])

b    20.0
c    40.0
a    10.0
d     NaN
dtype: float64

>Extracting elements from a Series Object

In [6]:
n1

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
n1[3]

4

In [8]:
n1[:3]        #extracting series of 3 elements

a    1
b    2
c    3
dtype: int64

In [9]:
n1[-3]       #3rd element from back

2

In [10]:
n1[-3:]     #sequence of elements from back

b    2
c    3
d    4
dtype: int64

>Mathematical operations

In [15]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([5,6,7,8,9])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
s2

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [17]:
s1+1     #adding a scaler value to all elements

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [18]:
s1+s2    #adding two Series Objects

0     6
1     8
2    10
3    12
4    14
dtype: int64

### Data Frames

It is a multi dimensional labelled data structure

In [19]:
d1 = pd.DataFrame({"Name":["Saloni","Shruti","Somya"],"Age" :[19,23,45]})
d1

     Name  Age
0  Saloni   19
1  Shruti   23
2   Somya   45

>Built in functions

In [23]:
df = pd.DataFrame({"Name":["Bob","Tom","Ruby","John","Beer","Tyler","Jeremy"],"Age":[20,45,67,12,60,52,32],"Marks": [34,56,67,90,100,86,55]})
df

     Name  Age  Marks
0     Bob   20     34
1     Tom   45     56
2    Ruby   67     67
3    John   12     90
4    Beer   60    100
5   Tyler   52     86
6  Jeremy   32     55

In [22]:
df.head()       #gives the first 5 entries

   Name  Age  Marks
0   Bob   20     34
1   Tom   45     56
2  Ruby   67     67
3  John   12     90
4  Beer   60    100

In [24]:
df.tail()      #gives last 5 entries

     Name  Age  Marks
2    Ruby   67     67
3    John   12     90
4    Beer   60    100
5   Tyler   52     86
6  Jeremy   32     55

In [26]:
df.shape

(7, 3)

In [27]:
df.describe()       #we get a lot of information using this

             Age       Marks
count   7.000000    7.000000
mean   41.142857   69.714286
std    20.562333   23.385995
min    12.000000   34.000000
25%    26.000000   55.500000
50%    45.000000   67.000000
75%    56.000000   88.000000
max    67.000000  100.000000

>Extracting individual data

> We use iloc and loc.

In [28]:
df.iloc[0:3,0:2]    #we are extracting data from rows 0-3(3 exclusive) and columns 0-2 ( 2 exclusive)

   Name  Age
0   Bob   20
1   Tom   45
2  Ruby   67

In [29]:
df.loc[0:3,("Marks")]      #here we extract based on the column name.Note: that here 3 is inclusive

0    34
1    56
2    67
3    90
Name: Marks, dtype: int64

> Dropping rows or columns. For dropping columns axis = 1, for dropping rows axis = 0

In [30]:
df.drop('Age',axis = 1)    #first argument is the column name and second is the axis

     Name  Marks
0     Bob     34
1     Tom     56
2    Ruby     67
3    John     90
4    Beer    100
5   Tyler     86
6  Jeremy     55

In [31]:
df.drop([2,3],axis =0)     #to drop particular rows

     Name  Age  Marks
0     Bob   20     34
1     Tom   45     56
4    Beer   60    100
5   Tyler   52     86
6  Jeremy   32     55

There are many such methods that can be performed.